Q1. Create a New Database and  Table for Employees

Task: Create a new database named and Create a table named with the following columns:

- Answer 1.

            CREAE DATABASE company_db;

            USE company_db;



- CREATE TABLE employees(
          
          employee_id INT PRIMARY KEY,

          first_name VARCHAR(50),
          
          last_name VARCHAR(50),
          
          department VARCHAR(50),
          
          salary INT,
          
          hire_date DATE
          
            );

            
Q2. Insert Data into Employees Table

Task: Insert the following sample records into the employees table

- Answer 2

  INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date) VALUES

  (101,'Amit', 'Sharma', 'HR', 50000, '2020-01-15'),
  
  (102, 'Riya', 'Kapoor', 'Sales', 75000, '2019-03-22'),
  
  (103, 'Raj', 'Mehta', 'IT', 90000, '2018-07-11'),
  
  (104, 'Neha', 'Verma', 'IT', 85000, '2021-09-01'),
  
  (105, 'Arjun', 'Singh', 'Finance', 60000, '2022-02-10');


Q3. Display All Employee Records Sorted by Salary (Lowest to Highest)

Hint: Use the ORDER BY clause on the salary column.  

- Answer 3

  SELECT * FROM employees

  ORDER BY salary ASC;


Q4. Show Employees Sorted by Department (A–Z) and Salary (High → Low)

- Answer 4

  SELECT * FROM Employees

  ORDER BY Department ASC, Salary DESC;

Q5. List All Employees in the IT Department, Ordered by Hire Date (Newest First)

- Answer 5

  SELECT * FROM Employees
  
  WHERE Department = 'IT'
  
  ORDER BY HireDate DESE;



Q6. Create and Populate a Sales Table

Task: Create a table Sales to track sales data:

- Answer 6

    CREATE TABLE sales (

    sale_id INT PRIMARY KEY,
    
    customer_name VARCHAR(50),
    
    amount INT,
    
    sale_date DATE

  );


- INSERT INTO sales (sale_id, customer_name, amount, sale_date) VALUES

  (1, 'Aditi', '1500', '2024-08-01'),

  (2, 'Rohan', '2200', '2024-08-03'),

  (3, 'Aditi', '3500', '2024-09-05'),

  (4, 'Meena', '2700', '2024-09-15'),

  (5, 'Rohan', '4500', '2024-09-25');


Q7. Display All Sales Records Sorted by Amount (Highest → Lowest)

Hint: Use ORDER BY amount DESE.

- Answer 7

  SELECT * FROM sales

  ORDER BY amount DESE;


Q8. Show All Sales Made by Customer “Aditi”

Hint: Use WHERE customer_name = 'Aditi'.

- Answer 8

  SELECT * FROM sales

  WHERE customer_name = 'Aditi';



Q9. What is the Difference Between a Primary Key and a Foreign Key?

- Answer 9

  - PRIMARY KEY
  Uniquely identifies each record in a table.
  Must be unique, cannot contain NULL values.
  Only one primary key is allowed per table.

  - FOREIGN KEY
  Establishes a link between data in two tables.
  Can contain duplicate values and NULL values.
  A table can have multiple foreign keys.


Q10. What Are Constraints in SQL and Why Are They Used?

- Answer 10

  constraints are rules applied to columns or tables to limit the type of data that can be entered.

  Without constraints, a database could quickly become a mess of "garbage data." For example some constraints (NOT NULL, UNIQUE, PRIMARY KEY, FOREIGN KEY, CHECK, DEFAULT)